### Idioms

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(
   ...:     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
   ...: )

df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

### if-thenâ€¦

In [5]:
df.loc[df.AAA>=5,'BBB'] = -1
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [6]:
df.loc[df.AAA >= 5, ["BBB", "CCC"]] = 555
df

   AAA  BBB  CCC
0    4   10  100
1    5  555  555
2    6  555  555
3    7  555  555

In [7]:
df.loc[df.AAA < 5, ["BBB", "CCC"]] = 2000
df

   AAA   BBB   CCC
0    4  2000  2000
1    5   555   555
2    6   555   555
3    7   555   555

In [8]:
df_mask = pd.DataFrame(
   ...:     {"AAA": [True] * 4, "BBB": [False] * 4, "CCC": [True, False] * 2}
   ...: )

df.where(df_mask,-1000)

   AAA   BBB   CCC
0    4 -1000  2000
1    5 -1000 -1000
2    6 -1000   555
3    7 -1000 -1000

In [9]:
df = pd.DataFrame(
   ....:     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
   ....: )
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [14]:
df['logic'] = np.where(df['AAA']>5,'high','low')
df

   AAA  BBB  CCC logic
0    4   10  100   low
1    5   20   50   low
2    6   30  -30  high
3    7   40  -50  high

### Splitting

#### Split a frame with a boolean criterion

In [15]:
df = pd.DataFrame(
   ....:     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
   ....: )
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [16]:
df[df.AAA <= 5]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

In [17]:
df[df.AAA > 5]

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

### Building criteria
#### Select with multi-column criteria

In [3]:
df = pd.DataFrame(
   ....:     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
   ....: )
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [4]:
df.loc[(df["BBB"] < 25) & (df["CCC"] >= -40), "AAA"]

0    4
1    5
Name: AAA, dtype: int64

In [5]:
df.loc[(df["BBB"] > 25) | (df["CCC"] >= -40), "AAA"]

0    4
1    5
2    6
3    7
Name: AAA, dtype: int64

In [7]:
df.loc[(df["BBB"] > 25) | (df["CCC"] >= 75), "AAA"] = 0.1
df

   AAA  BBB  CCC
0  0.1   10  100
1  5.0   20   50
2  0.1   30  -30
3  0.1   40  -50

In [11]:
# Select rows with data closest to certain value using argsort
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]})
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [12]:
aValue = 43.0
df.loc[(df.CCC - aValue).abs().argsort()]

   AAA  BBB  CCC
1    5   20   50
0    4   10  100
2    6   30  -30
3    7   40  -50

In [13]:
df = pd.DataFrame(
   ....:     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
   ....: )
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [14]:
Crit1 = df.AAA <= 5.5
Crit2 = df.BBB == 10.0
Crit3 = df.CCC > -40.0

In [17]:
AllCrit = Crit1 & Crit2 & Crit3
df[AllCrit]

   AAA  BBB  CCC
0    4   10  100

In [18]:
import functools
CritList = [Crit1, Crit2, Crit3]
AllCrit = functools.reduce(lambda x,y : x&y,CritList)
df[AllCrit]

   AAA  BBB  CCC
0    4   10  100

### Selection

In [19]:
df = pd.DataFrame(
   ....:     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
   ....: )
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [20]:
df[(df.AAA <= 6) & (df.index.isin([0, 2, 4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [23]:
# Use loc for label-oriented slicing and iloc positional slicing
df = pd.DataFrame(
        {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]},
        index=["foo", "bar", "boo", "kar"],)
df

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

#### There are 2 explicit slicing methods, with a third general case

    1.Positional-oriented (Python slicing style : exclusive of end)

    2.Label-oriented (Non-Python slicing style : inclusive of end)

    3.General (Either slicing style : depends on if the slice contains labels or positions)

In [24]:
df.loc["bar":"kar"]  # Label

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [25]:
df[0:3]

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30

In [26]:
df["bar":"kar"]

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [29]:
# Ambiguity arises when an index consists of integers with a non-zero start or non-unit increment.
data = {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}

df2 = pd.DataFrame(data=data, index=[1, 2, 3, 4])  # Note index starts at 1.
df2

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30
4    7   40  -50

In [28]:
df2.iloc[1:3]  # Position-oriented

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [30]:
df2.loc[1:3]  # Label-oriented

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [33]:
# Using inverse operator (~) to take the complement of a mask
df = pd.DataFrame(
     {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]} )
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [34]:
df[~((df.AAA <= 6) & (df.index.isin([0, 2, 4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

### New columns
#### Efficiently and dynamically creating new columns using applymap

In [35]:
df = pd.DataFrame({"AAA": [1, 2, 1, 3], "BBB": [1, 1, 2, 2], "CCC": [2, 1, 3, 1]})
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [36]:
source_cols = df.columns  # Or some subset would work too
source_cols

Index(['AAA', 'BBB', 'CCC'], dtype='object')

In [39]:
new_cols = [str(x) + "_cat" for x in source_cols]
new_cols

['AAA_cat', 'BBB_cat', 'CCC_cat']

In [38]:
categories = {1: "Alpha", 2: "Beta", 3: "Charlie"}

In [42]:
df[new_cols] = df[source_cols].applymap(categories.get)
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpha   Alpha     Beta
1    2    1    1     Beta   Alpha    Alpha
2    1    2    3    Alpha    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpha

In [44]:
df = pd.DataFrame(
        {"AAA": [1, 1, 1, 2, 2, 2, 3, 3], "BBB": [2, 1, 3, 4, 5, 1, 2, 3]}
   )
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [45]:
# Method 1 : idxmin() to get the index of the minimums
df.loc[df.groupby("AAA")["BBB"].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

In [46]:
# Method 2 : sort then take first of each
df.sort_values(by="BBB").groupby("AAA", as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2

### Multiindexing

In [4]:
df = pd.DataFrame(
   ....:     {
   ....:         "row": [0, 1, 2],
   ....:         "One_X": [1.1, 1.1, 1.1],
   ....:         "One_Y": [1.2, 1.2, 1.2],
   ....:         "Two_X": [1.11, 1.11, 1.11],
   ....:         "Two_Y": [1.22, 1.22, 1.22],
   ....:     }
   ....: )
df

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [5]:
# As Labelled Index
df = df.set_index("row")
df

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.22
1      1.1    1.2   1.11   1.22
2      1.1    1.2   1.11   1.22

In [6]:
# With Hierarchical Columns
df.columns = pd.MultiIndex.from_tuples([tuple(c.split("_")) for c in df.columns])
df

     One        Two
       X    Y     X     Y
row
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

In [7]:
# Now stack & Reset
df = df.stack(0).reset_index(1)
df

    level_1     X     Y
row
0       One  1.10  1.20
0       Two  1.11  1.22
1       One  1.10  1.20
1       Two  1.11  1.22
2       One  1.10  1.20
2       Two  1.11  1.22

In [8]:
# And fix the labels (Notice the label 'level_1' got added automatically)
df.columns = ["Sample", "All_X", "All_Y"]
df

    Sample  All_X  All_Y
row
0      One   1.10   1.20
0      Two   1.11   1.22
1      One   1.10   1.20
1      Two   1.11   1.22
2      One   1.10   1.20
2      Two   1.11   1.22

### Arithmetic
#### Performing arithmetic with a MultiIndex that needs broadcasting

In [9]:
cols = pd.MultiIndex.from_tuples(
   ....:     [(x, y) for x in ["A", "B", "C"] for y in ["O", "I"]]
   ....: )

In [10]:
df = pd.DataFrame(np.random.randn(2, 6), index=["n", "m"], columns=cols)
df

          A                   B                   C
          O         I         O         I         O         I
n  0.206742 -1.070791 -1.128326  1.040524 -1.555200 -1.212141
m -0.655130 -0.390750 -0.212206 -0.750581  1.347254  0.809497

In [12]:
df = df.div(df["C"], level=1)
df

          A                   B              C
          O         I         O         I    O    I
n -0.132936  0.883388  0.725518 -0.858418  1.0  1.0
m -0.486271 -0.482707 -0.157510 -0.927219  1.0  1.0

### Slicing
#### Slicing a MultiIndex with xs

In [13]:
coords = [("AA", "one"), ("AA", "six"), ("BB", "one"), ("BB", "two"), ("BB", "six")]
index = pd.MultiIndex.from_tuples(coords)

In [14]:
df = pd.DataFrame([11, 22, 33, 44, 55], index, ["MyData"])
df

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [15]:
#To take the cross section of the 1st level and 1st axis the index:
# Note : level and axis are optional, and default to zero

df.xs("BB", level=0, axis=0)

     MyData
one      33
two      44
six      55

In [16]:
# â€¦and now the 2nd level of the 1st axis.
df.xs("six", level=1, axis=0)

    MyData
AA      22
BB      55

In [18]:
# Slicing a MultiIndex with xs, method #2
import itertools
index = list(itertools.product(["Ada", "Quinn", "Violet"], ["Comp", "Math", "Sci"]))
headr = list(itertools.product(["Exams", "Labs"], ["I", "II"]))
indx = pd.MultiIndex.from_tuples(index, names=["Student", "Course"])
cols = pd.MultiIndex.from_tuples(headr)  # Notice these are un-named
data = [[70 + x + y + (x * y) % 3 for x in range(4)] for y in range(9)]
df = pd.DataFrame(data, indx, cols)
df

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [19]:
All = slice(None)

In [20]:
df.loc["Violet"]

       Exams     Labs
           I  II    I  II
Course
Comp      76  77   78  79
Math      77  79   81  80
Sci       78  81   81  81

In [21]:
df.loc[(All, "Math"), All]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77
Violet  Math      77  79   81  80

In [22]:
df.loc[(slice("Ada", "Quinn"), "Math"), All]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77

In [23]:
df.loc[(All, "Math"), ("Exams")]

                 I  II
Student Course
Ada     Math    71  73
Quinn   Math    74  76
Violet  Math    77  79

In [24]:
df.loc[(All, "Math"), (All, "II")]

               Exams Labs
                  II   II
Student Course
Ada     Math      73   74
Quinn   Math      76   77
Violet  Math      79   80

### Sorting
#### Sort by specific column or an ordered list of columns, with a MultiIndex

In [25]:
df.sort_values(by=("Labs", "II"), ascending=False)

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

### Missing data

In [27]:
df = pd.DataFrame(
   .....:     np.random.randn(6, 1),
   .....:     index=pd.date_range("2013-08-01", periods=6, freq="B"),
   .....:     columns=list("A"),
   .....: )
df

                   A
2013-08-01  0.412503
2013-08-02  0.529697
2013-08-05 -1.698475
2013-08-06 -1.157589
2013-08-07 -0.564015
2013-08-08  0.911460

In [28]:
df.loc[df.index[3], "A"] = np.nan
df

                   A
2013-08-01  0.412503
2013-08-02  0.529697
2013-08-05 -1.698475
2013-08-06       NaN
2013-08-07 -0.564015
2013-08-08  0.911460

In [29]:
df.reindex(df.index[::-1]).ffill()

                   A
2013-08-08  0.911460
2013-08-07 -0.564015
2013-08-06 -0.564015
2013-08-05 -1.698475
2013-08-02  0.529697
2013-08-01  0.412503

### Grouping

In [30]:
df = pd.DataFrame(
   .....:     {
   .....:         "animal": "cat dog cat fish dog cat cat".split(),
   .....:         "size": list("SSMMMLL"),
   .....:         "weight": [8, 10, 11, 1, 20, 12, 12],
   .....:         "adult": [False] * 5 + [True] * 2,
   .....:     }
   .....: )

df

  animal size  weight  adult
0    cat    S       8  False
1    dog    S      10  False
2    cat    M      11  False
3   fish    M       1  False
4    dog    M      20  False
5    cat    L      12   True
6    cat    L      12   True

In [31]:
# List the size of the animals with the highest weight.
df.groupby("animal").apply(lambda subf: subf["size"][subf["weight"].idxmax()])

animal
cat     L
dog     M
fish    M
dtype: object

In [33]:
# Using get_group
gb = df.groupby(["animal"])
gb.get_group('cat')

  animal size  weight  adult
0    cat    S       8  False
2    cat    M      11  False
5    cat    L      12   True
6    cat    L      12   True

In [38]:
# Apply to different items in a group
def GrowUp(x):
        avg_weight = sum(x[x["size"] == "S"].weight * 1.5)
        avg_weight += sum(x[x["size"] == "M"].weight * 1.25)
        avg_weight += sum(x[x["size"] == "L"].weight)
        avg_weight /= len(x)
        return pd.Series(["L", avg_weight, True], index=["size", "weight", "adult"])

expected_df = gb.apply(GrowUp)
expected_df

       size   weight  adult
animal
cat       L  12.4375   True
dog       L  20.0000   True
fish      L   1.2500   True

In [39]:
# Expanding apply
S = pd.Series([i / 100.0 for i in range(1, 11)])

In [43]:
def cum_ret(x, y):
        return x * (1 + y)

In [46]:
import functools
def red(x):
        return functools.reduce(cum_ret, x, 1.0)

In [47]:
S.expanding().apply(red, raw=True)

0    1.010000
1    1.030200
2    1.061106
3    1.103550
4    1.158728
5    1.228251
6    1.314229
7    1.419367
8    1.547110
9    1.701821
dtype: float64

In [49]:
# Replacing some values with mean of the rest of a group
df = pd.DataFrame({"A": [1, 1, 2, 2], "B": [1, -1, 1, 2]})
gb = df.groupby("A")
def replace(g):
        mask = g < 0
        return g.where(mask, g[~mask].mean())
gb.transform(replace)

     B
0  1.0
1 -1.0
2  1.5
3  1.5

In [4]:
# Sort groups by aggregated data
df = pd.DataFrame(
        {
            "code": ["foo", "bar", "baz"] * 2,
            "data": [0.16, -0.21, 0.33, 0.45, -0.59, 0.62],
            "flag": [False, True] * 3,
        }
    )
df

  code  data   flag
0  foo  0.16  False
1  bar -0.21   True
2  baz  0.33  False
3  foo  0.45   True
4  bar -0.59  False
5  baz  0.62   True

In [5]:
code_groups = df.groupby("code")
agg_n_sort_order = code_groups[["data"]].transform(sum).sort_values(by="data")
sorted_df = df.loc[agg_n_sort_order.index]
sorted_df

  code  data   flag
1  bar -0.21   True
4  bar -0.59  False
0  foo  0.16  False
3  foo  0.45   True
2  baz  0.33  False
5  baz  0.62   True

In [6]:
# Create multiple aggregated columns
rng = pd.date_range(start="2014-10-07", periods=10, freq="2min")
ts = pd.Series(data=list(range(10)), index=rng)

def MyCust(x):
        if len(x) > 2:
            return x[1] * 1.234
        return pd.NaT
    
mhc = {"Mean": np.mean, "Max": np.max, "Custom": MyCust}
ts.resample("5min").apply(mhc)

Mean    2014-10-07 00:00:00      1.0
        2014-10-07 00:05:00      3.5
        2014-10-07 00:10:00      6.0
        2014-10-07 00:15:00      8.5
Max     2014-10-07 00:00:00        2
        2014-10-07 00:05:00        4
        2014-10-07 00:10:00        7
        2014-10-07 00:15:00        9
Custom  2014-10-07 00:00:00    1.234
        2014-10-07 00:05:00      NaT
        2014-10-07 00:10:00    7.404
        2014-10-07 00:15:00      NaT
dtype: object

In [7]:
ts

2014-10-07 00:00:00    0
2014-10-07 00:02:00    1
2014-10-07 00:04:00    2
2014-10-07 00:06:00    3
2014-10-07 00:08:00    4
2014-10-07 00:10:00    5
2014-10-07 00:12:00    6
2014-10-07 00:14:00    7
2014-10-07 00:16:00    8
2014-10-07 00:18:00    9
Freq: 2T, dtype: int64

In [10]:
# Create a value counts column and reassign back to the DataFrame
df = pd.DataFrame(
        {"Color": "Red Red Red Blue".split(), "Value": [100, 150, 50, 50]}
    )
df

  Color  Value
0   Red    100
1   Red    150
2   Red     50
3  Blue     50

In [11]:
df["Counts"] = df.groupby(["Color"]).transform(len)
df

  Color  Value  Counts
0   Red    100       3
1   Red    150       3
2   Red     50       3
3  Blue     50       1

In [14]:
# Shift groups of the values in a column based on the index
df = pd.DataFrame(
        {"line_race": [10, 10, 8, 10, 10, 8], "beyer": [99, 102, 103, 103, 88, 100]},
        index=[
            "Last Gunfighter",
            "Last Gunfighter",
            "Last Gunfighter",
            "Paynter",
            "Paynter",
            "Paynter",
        ],
    )
df

                 line_race  beyer
Last Gunfighter         10     99
Last Gunfighter         10    102
Last Gunfighter          8    103
Paynter                 10    103
Paynter                 10     88
Paynter                  8    100

In [15]:
df["beyer_shifted"] = df.groupby(level=0)["beyer"].shift(1)
df

                 line_race  beyer  beyer_shifted
Last Gunfighter         10     99            NaN
Last Gunfighter         10    102           99.0
Last Gunfighter          8    103          102.0
Paynter                 10    103            NaN
Paynter                 10     88          103.0
Paynter                  8    100           88.0

In [19]:
# Select row with maximum value from each group
df = pd.DataFrame(
        {
            "host": ["other", "other", "that", "this", "this"],
            "service": ["mail", "web", "mail", "mail", "web"],
            "no": [1, 2, 1, 2, 1],
        }
    ).set_index(["host", "service"])
df

               no
host  service
other mail      1
      web       2
that  mail      1
this  mail      2
      web       1

In [20]:
mask = df.groupby(level=0).agg("idxmax")
df_count = df.loc[mask["no"]].reset_index()
df_count

    host service  no
0  other     web   2
1   that    mail   1
2   this    mail   2

In [22]:
# Grouping like Pythonâ€™s itertools.groupby
df = pd.DataFrame([0, 1, 0, 1, 1, 1, 0, 1, 1], columns=["A"])
df

   A
0  0
1  1
2  0
3  1
4  1
5  1
6  0
7  1
8  1

In [23]:
df["A"].groupby((df["A"] != df["A"].shift()).cumsum()).groups

{1: [0], 2: [1], 3: [2], 4: [3, 4, 5], 5: [6], 6: [7, 8]}

In [24]:
df["A"].groupby((df["A"] != df["A"].shift()).cumsum()).cumsum()

0    0
1    1
2    0
3    1
4    2
5    3
6    0
7    1
8    2
Name: A, dtype: int64

### Expanding data

### Splitting
#### Splitting a frame

#### Create a list of dataframes, split using a delineation based on logic included in rows.

In [25]:
df = pd.DataFrame(
        data={
            "Case": ["A", "A", "A", "B", "A", "A", "B", "A", "A"],
            "Data": np.random.randn(9),
        }
    )
df

  Case      Data
0    A -0.156063
1    A  0.193483
2    A  0.081860
3    B -0.917866
4    A -0.077369
5    A -1.805483
6    B -0.110391
7    A  0.477445
8    A  2.684037

In [26]:
dfs = list(
        zip(
            *df.groupby(
                (1 * (df["Case"] == "B"))
                .cumsum()
                .rolling(window=3, min_periods=1)
                .median()
            )
        )
    )[-1]

In [27]:
dfs[0]

  Case      Data
0    A -0.156063
1    A  0.193483
2    A  0.081860
3    B -0.917866

In [28]:
dfs[1]

  Case      Data
4    A -0.077369
5    A -1.805483
6    B -0.110391

In [29]:
dfs[2]

  Case      Data
7    A  0.477445
8    A  2.684037

### Pivot

In [31]:
df = pd.DataFrame(
        data={
            "Province": ["ON", "QC", "BC", "AL", "AL", "MN", "ON"],
            "City": [
                "Toronto",
                "Montreal",
                "Vancouver",
                "Calgary",
                "Edmonton",
                "Winnipeg",
                "Windsor",
            ],
            "Sales": [13, 6, 16, 8, 4, 3, 1],
        }
    )
df

  Province       City  Sales
0       ON    Toronto     13
1       QC   Montreal      6
2       BC  Vancouver     16
3       AL    Calgary      8
4       AL   Edmonton      4
5       MN   Winnipeg      3
6       ON    Windsor      1

In [32]:
table = pd.pivot_table(
        df,
        values=["Sales"],
        index=["Province"],
        columns=["City"],
        aggfunc=np.sum,
        margins=True,
    )

In [33]:
table.stack("City")

                    Sales
Province City
AL       All         12.0
         Calgary      8.0
         Edmonton     4.0
BC       All         16.0
         Vancouver   16.0
MN       All          3.0
         Winnipeg     3.0
ON       All         14.0
         Toronto     13.0
         Windsor      1.0
QC       All          6.0
         Montreal     6.0
All      All         51.0
         Calgary      8.0
         Edmonton     4.0
         Montreal     6.0
         Toronto     13.0
         Vancouver   16.0
         Windsor      1.0
         Winnipeg     3.0

In [34]:
grades = [48, 99, 75, 80, 42, 80, 72, 68, 36, 78]
df = pd.DataFrame(
        {
            "ID": ["x%d" % r for r in range(10)],
            "Gender": ["F", "M", "F", "M", "F", "M", "F", "M", "M", "M"],
            "ExamYear": [
                "2007",
                "2007",
                "2007",
                "2008",
                "2008",
                "2008",
                "2008",
                "2009",
                "2009",
                "2009",
            ],"Class": [
                "algebra",
                "stats",
                "bio",
                "algebra",
                "algebra",
                "stats",
                "stats",
                "algebra",
                "bio",
                "bio",
            ],
            "Participated": [
                "yes",
                "yes",
                "yes",
                "yes",
                "no",
                "yes",
                "yes",
                "yes",
                "yes",
                "yes",
            ],
            "Passed": ["yes" if x > 50 else "no" for x in grades],
            "Employed": [
                True,
                True,
                True,
                False,
                False,
                False,
                False,
                True,
                True,
                False,
            ],
            "Grade": grades,
        }
    )
df.groupby("ExamYear").agg(
        {
            "Participated": lambda x: x.value_counts()["yes"],
            "Passed": lambda x: sum(x == "yes"),
            "Employed": lambda x: sum(x),
            "Grade": lambda x: sum(x) / len(x),
        }
    )

          Participated  Passed  Employed      Grade
ExamYear
2007                 3       2         3  74.000000
2008                 3       3         0  68.500000
2009                 3       2         2  60.666667

#### Plot pandas DataFrame with year over year data

#### To create year and month cross tabulation:

In [38]:
df = pd.DataFrame(
        {"value": np.random.randn(36)},
        index=pd.date_range("2011-01-01", freq="M", periods=36),
    )
df

               value
2011-01-31 -1.030515
2011-02-28 -2.741128
2011-03-31 -1.350097
2011-04-30  1.598929
2011-05-31 -0.049741
2011-06-30  1.745399
2011-07-31 -0.052045
2011-08-31  0.473698
2011-09-30 -1.495452
2011-10-31 -0.777058
2011-11-30 -0.510432
2011-12-31 -0.555891
2012-01-31 -0.296687
2012-02-29 -1.528931
2012-03-31  0.771999
2012-04-30  0.157040
2012-05-31  0.294344
2012-06-30 -0.581298
2012-07-31 -0.965976
2012-08-31  0.003569
2012-09-30 -0.420087
2012-10-31  0.986001
2012-11-30 -0.453429
2012-12-31 -0.542028
2013-01-31 -0.212482
2013-02-28  0.335683
2013-03-31  0.749522
2013-04-30  1.206080
2013-05-31  0.806499
2013-06-30 -0.809738
2013-07-31 -0.423175
2013-08-31  1.130142
2013-09-30  0.806681
2013-10-31  0.089498
2013-11-30 -0.980975
2013-12-31 -0.267942

In [39]:
pd.pivot_table(
        df, index=df.index.month, columns=df.index.year, values="value", aggfunc="sum"
    )

        2011      2012      2013
1  -1.030515 -0.296687 -0.212482
2  -2.741128 -1.528931  0.335683
3  -1.350097  0.771999  0.749522
4   1.598929  0.157040  1.206080
5  -0.049741  0.294344  0.806499
6   1.745399 -0.581298 -0.809738
7  -0.052045 -0.965976 -0.423175
8   0.473698  0.003569  1.130142
9  -1.495452 -0.420087  0.806681
10 -0.777058  0.986001  0.089498
11 -0.510432 -0.453429 -0.980975
12 -0.555891 -0.542028 -0.267942

### Apply
#### Rolling apply to organize - Turning embedded lists into a MultiIndex frame

In [40]:
df = pd.DataFrame(
        data={
            "A": [[2, 4, 8, 16], [100, 200], [10, 20, 30]],
            "B": [["a", "b", "c"], ["jj", "kk"], ["ccc"]],
        },
        index=["I", "II", "III"],
    )
df

                 A          B
I    [2, 4, 8, 16]  [a, b, c]
II      [100, 200]   [jj, kk]
III   [10, 20, 30]      [ccc]

In [41]:
def SeriesFromSubList(aList):
        return pd.Series(aList)

In [42]:
df_orgz = pd.concat(
        {ind: row.apply(SeriesFromSubList) for ind, row in df.iterrows()}
    )

In [43]:
df_orgz

         0     1     2     3
I   A    2     4     8  16.0
    B    a     b     c   NaN
II  A  100   200   NaN   NaN
    B   jj    kk   NaN   NaN
III A   10  20.0  30.0   NaN
    B  ccc   NaN   NaN   NaN

In [4]:
# Rolling Apply to multiple columns where function calculates a Series before a Scalar from the Series is returned
df = pd.DataFrame(
        data=np.random.randn(2000, 2) / 10000,
        index=pd.date_range("2001-01-01", periods=2000),
        columns=["A", "B"],
    )
df

                   A         B
2001-01-01 -0.000164  0.000056
2001-01-02  0.000083  0.000014
2001-01-03 -0.000035 -0.000009
2001-01-04 -0.000124 -0.000048
2001-01-05  0.000057  0.000030
...              ...       ...
2006-06-19  0.000177 -0.000046
2006-06-20  0.000064 -0.000144
2006-06-21  0.000003  0.000121
2006-06-22  0.000110 -0.000122
2006-06-23 -0.000066 -0.000013

[2000 rows x 2 columns]

In [5]:
def gm(df, const):
        v = ((((df["A"] + df["B"]) + 1).cumprod()) - 1) * const
        return v.iloc[-1]

In [7]:
s = pd.Series(
        {
            df.index[i]: gm(df.iloc[i: min(i + 51, len(df) - 1)], 5)
            for i in range(len(df) - 50)
        }
    )
s

2001-01-01   -0.004766
2001-01-02   -0.004854
2001-01-03   -0.004558
2001-01-04   -0.003333
2001-01-05   -0.003337
                ...
2006-04-30    0.009925
2006-05-01    0.010159
2006-05-02    0.009467
2006-05-03    0.009125
2006-05-04    0.008880
Length: 1950, dtype: float64

In [8]:
# Rolling apply with a DataFrame returning a Scalar

# Rolling Apply to multiple columns where function returns a Scalar (Volume Weighted Average Price)
rng = pd.date_range(start="2014-01-01", periods=100)

df = pd.DataFrame(
        {
            "Open": np.random.randn(len(rng)),
            "Close": np.random.randn(len(rng)),
            "Volume": np.random.randint(100, 2000, len(rng)),
        },
        index=rng,
    )
df

                Open     Close  Volume
2014-01-01  1.555824 -1.499716    1868
2014-01-02  1.451499  0.949674     390
2014-01-03 -0.232936  0.208517    1145
2014-01-04 -0.247865 -0.018315     378
2014-01-05  0.071905 -0.256435     107
...              ...       ...     ...
2014-04-06  1.326220  1.849894     121
2014-04-07 -0.446553  0.049520    1797
2014-04-08 -0.916602 -0.394013    1692
2014-04-09 -1.062726  1.521217     931
2014-04-10  0.613748 -0.133608     998

[100 rows x 3 columns]

In [11]:
def vwap(bars):
        return (bars.Close * bars.Volume).sum() / bars.Volume.sum()
window = 5

In [12]:
s = pd.concat(
        [
            (pd.Series(vwap(df.iloc[i: i + window]), index=[df.index[i + window]]))
            for i in range(len(df) - window)
        ]
    )
s.round(2)

2014-01-06   -0.57
2014-01-07    0.17
2014-01-08    0.23
2014-01-09    0.07
2014-01-10    0.13
              ...
2014-04-06    0.14
2014-04-07   -0.09
2014-04-08   -0.05
2014-04-09   -0.05
2014-04-10    0.29
Length: 95, dtype: float64

### Merge

In [3]:
rng = pd.date_range("2000-01-01", periods=6)
df1 = pd.DataFrame(np.random.randn(6, 3), index=rng, columns=["A", "B", "C"])
df2 = df1.copy()

In [4]:
df = df1.append(df2, ignore_index=True)
df

           A         B         C
0   1.129363  2.869255 -0.016759
1  -1.289527 -0.448225  2.004927
2  -0.821990 -1.017264  0.022118
3  -0.058192 -0.651449 -2.368857
4   0.892510 -1.639397 -0.521565
5   0.369962 -0.166984  0.160842
6   1.129363  2.869255 -0.016759
7  -1.289527 -0.448225  2.004927
8  -0.821990 -1.017264  0.022118
9  -0.058192 -0.651449 -2.368857
10  0.892510 -1.639397 -0.521565
11  0.369962 -0.166984  0.160842